tests/HeleShaw/circularCell2D/src/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom       patch;
sourceCase          "$FOAM_CASE";

sourcePatches       (back);
exposedPatchName    front;

// extrudeModel        linearNormal;

extrudeModel        linearDirection;

nLayers             1;

expansionRatio      1.0;

// linearNormalCoeffs
// {
//     thickness       0.01;
// }

linearDirectionCoeffs
{
    direction       (0 0 1);
    thickness       0.001;
}

flipNormals         true;
mergeFaces          false;
mergeTol            0;


// ************************************************************************* //
