tests/HeleShaw/circularCell2D/src/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (phase1 phase2);

pMin            1000;

sigma           0.02;

// sigma
// {
//     type    liquidProperties;
//     phase   phase1;
// }

// sigma
// {
//     type    temperatureDependent;
//     sigma   table
//     (
//         (273.15 0.02410053)
//         (370.00 0.01562685)
//     );
// }


// ************************************************************************* //
