tests/HeleShaw/circularCell2D/src/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.phase1.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;

        nAlphaSmoothers     10;
        cSmCoeff            0.5;
        cShCoeff            0.5;
        nKappaSmoothers     2;
        cPhicFilterCoeff    0.025;
        cPhicThresholdCoeff 0.05;
    }

    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }

    pcorrFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          1e-2;
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }

    pc
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          1e-2;
    }

    pcFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }

    "U.*"
    {
//         solver          PBiCG;
//         preconditioner  DILU;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
    }

    "T.*"
    {
//         solver          PBiCG;
//         preconditioner  DILU;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor           no;
    nOuterCorrectors            3;
    nCorrectors                 3;
    nNonOrthogonalCorrectors    0;

//     pcRefCell                   0;
    pcRefPoint                  (0.05 0 0);
    pcRefValue                  0;

//     pRefCell                    0;
    pRefPoint                   (0.05 0 0);
    pRefValue                   1e5;

    outerCorrectorResidualControl
    {
        p_rgh
        {
            tolerance           1e-6;
            relTol              0;
        }

        U
        {
            tolerance           1e-6;
            relTol              0;
        }

        T
        {
            tolerance           1e-6;
            relTol              0;
        }
    }

//     residualControl
//     {
//         p_rgh                   1e-4;
//         U                       1e-4;
//         T                       1e-4;
//     }

    turbOnFinalIterOnly on;
}

relaxationFactors
{
    fields
    {
//         p_rgh                   0.3;
//         p_rghFinal              1;
//         phic                    0.7;
//         phicFinal               1;
        fc                      0.7;
        fcFinal                 1;
        fcFilt                  0.7;
        fcFiltFinal             1;
        fcf                     0.7;
        fcfFinal                1;
        fcfFilt                 0.7;
        fcfFiltFinal            1;
    }
    equations
    {
        U                       0.7;
        UFinal                  1;
        ".*" 1;
    }
}


// ************************************************************************* //
