tests/HeleShaw/circularCell2D/src/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.phase1 1
);

regions
(
//     boxToCell
//     {
//         box (-0.005 -0.005 -1e6) (0.005 0.005 1e6);
//         fieldValues
//         (
//             volScalarFieldValue alpha.phase1 0
//         );
//     }

    cylinderToCell
    {
        point1 (0 0 -1);
        point2 (0 0 1);
        centre (0 0 0);
        radius 0.003;
        fieldValues
        (
            volScalarFieldValue alpha.phase1 0
        );
    }

//     sphereToCell
//     {
//         centre (0 0 0);
//         radius 0.003;
//         fieldValues
//         (
//             volScalarFieldValue alpha.phase1 0
//         );
//     }
);


// ************************************************************************* //
